---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearMod2
source: html/b67a8afa-e584-460d-cb52-b9ff8c7c5a27.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PhyMaterialParamShearMod2 Property

"Shear modulus Y"

## Syntax (C#)
```csharp
public static ForgeTypeId PhyMaterialParamShearMod2 { get; }
```